print('------------------Задание 1-------------')
print("hello, world")
print("Маша + Петя = Любовь")
print('3+4=х')
х=3+4
print(х)
print('----------Задание 2-----------')
x="hello world"
print(type(х))
х=3+4
print(type(х))
х=3/4
print(type(х))
х=[1,2,5,10,100]
print(type(х))
print("---------------Задание 3--------------")
х=3
print('х=',х )
y=(х/(х**3+(3/х)))*(4*х**7-х**5)+80*((27*х**4+12*х**3-5*х**2+10)**0.5)
print('y=',y )
y=((3//2)%1+(16.7*4.32)//1)//(14.5+((31/12)%1)-(х**3.4)//1)
print('y=',y)